nxp-mcuxpresso/mcux-sdk-examples/twrkm34z50mv3/demo_apps/slcd_guessnum/pin_mux.c
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MKM34Z128Axxx5
package_id: MKM34Z128ACLL5
mcu_data: ksdk2_0
processor_version: 0.9.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '1', peripheral: LCD, signal: 'P, 23', pin_signal: LCD23/PTA0}
  - {pin_num: '2', peripheral: LCD, signal: 'P, 24', pin_signal: LCD24/PTA1}
  - {pin_num: '3', peripheral: LCD, signal: 'P, 25', pin_signal: LCD25/PTA2}
  - {pin_num: '4', peripheral: LCD, signal: 'P, 26', pin_signal: LCD26/PTA3}
  - {pin_num: '5', peripheral: LCD, signal: 'P, 27', pin_signal: LCD27/PTA4/LLWU_P15/NMI_B}
  - {pin_num: '6', peripheral: LCD, signal: 'P, 28', pin_signal: LCD28/PTA5}
  - {pin_num: '9', peripheral: LCD, signal: 'P, 31', pin_signal: LCD31/PTB0}
  - {pin_num: '12', peripheral: LCD, signal: 'P, 32', pin_signal: LCD32/PTB1}
  - {pin_num: '13', peripheral: LCD, signal: 'P, 33', pin_signal: LCD33/PTB2}
  - {pin_num: '14', peripheral: LCD, signal: 'P, 34', pin_signal: LCD34/PTB3}
  - {pin_num: '15', peripheral: LCD, signal: 'P, 35', pin_signal: LCD35/PTB4}
  - {pin_num: '16', peripheral: LCD, signal: 'P, 36', pin_signal: LCD36/PTB5}
  - {pin_num: '17', peripheral: LCD, signal: 'P, 37', pin_signal: LCD37/CMP1P0/PTB6}
  - {pin_num: '23', peripheral: LCD, signal: 'P, 43', pin_signal: LCD43/PTC4}
  - {pin_num: '77', peripheral: LCD, signal: 'P, 9', pin_signal: LCD9/AD11/PTG2/SPI0_SS_B/LLWU_P1}
  - {pin_num: '78', peripheral: LCD, signal: 'P, 10', pin_signal: LCD10/PTG3/SPI0_SCK/I2C0_SCL}
  - {pin_num: '79', peripheral: LCD, signal: 'P, 11', pin_signal: LCD11/PTG4/SPI0_MOSI/I2C0_SDA}
  - {pin_num: '80', peripheral: LCD, signal: 'P, 12', pin_signal: LCD12/PTG5/SPI0_MISO/LPTIM1}
  - {pin_num: '81', peripheral: LCD, signal: 'P, 13', pin_signal: LCD13/PTG6/LLWU_P0/LPTIM2}
  - {pin_num: '82', peripheral: LCD, signal: 'P, 14', pin_signal: LCD14/PTG7}
  - {pin_num: '83', peripheral: LCD, signal: 'P, 15', pin_signal: LCD15/PTH0}
  - {pin_num: '84', peripheral: LCD, signal: 'P, 16', pin_signal: LCD16/PTH1}
  - {pin_num: '85', peripheral: LCD, signal: 'P, 17', pin_signal: LCD17/PTH2}
  - {pin_num: '86', peripheral: LCD, signal: 'P, 18', pin_signal: LCD18/PTH3}
  - {pin_num: '87', peripheral: LCD, signal: 'P, 19', pin_signal: LCD19/PTH4}
  - {pin_num: '88', peripheral: LCD, signal: 'P, 20', pin_signal: LCD20/PTH5}
  - {pin_num: '93', peripheral: LCD, signal: 'P, 21', pin_signal: LCD21/PTI2}
  - {pin_num: '94', peripheral: LCD, signal: 'P, 22', pin_signal: LCD22/PTI3}
  - {pin_num: '91', peripheral: UART1, signal: RX, pin_signal: CMP0P5/PTI0/SCI1_RxD/PXBAR_IN8/SPI1_MISO/SPI1_MOSI}
  - {pin_num: '92', peripheral: UART1, signal: TX, pin_signal: PTI1/SCI1_TxD/PXBAR_OUT8/SPI1_MOSI/SPI1_MISO}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* PCTLA Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* PCTLB Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* PCTLC Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* PCTLG Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortG);
    /* PCTLH Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortH);
    /* PCTLI Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortI);

    /* PORTA0 (pin 1) is configured as LCD23 */
    PORT_SetPinMux(PORTA, 0U, kPORT_PinDisabledOrAnalog);

    /* PORTA1 (pin 2) is configured as LCD24 */
    PORT_SetPinMux(PORTA, 1U, kPORT_PinDisabledOrAnalog);

    /* PORTA2 (pin 3) is configured as LCD25 */
    PORT_SetPinMux(PORTA, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTA3 (pin 4) is configured as LCD26 */
    PORT_SetPinMux(PORTA, 3U, kPORT_PinDisabledOrAnalog);

    /* PORTA4 (pin 5) is configured as LCD27 */
    PORT_SetPinMux(PORTA, 4U, kPORT_PinDisabledOrAnalog);

    /* PORTA5 (pin 6) is configured as LCD28 */
    PORT_SetPinMux(PORTA, 5U, kPORT_PinDisabledOrAnalog);

    /* PORTB0 (pin 9) is configured as LCD31 */
    PORT_SetPinMux(PORTB, 0U, kPORT_PinDisabledOrAnalog);

    /* PORTB1 (pin 12) is configured as LCD32 */
    PORT_SetPinMux(PORTB, 1U, kPORT_PinDisabledOrAnalog);

    /* PORTB2 (pin 13) is configured as LCD33 */
    PORT_SetPinMux(PORTB, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTB3 (pin 14) is configured as LCD34 */
    PORT_SetPinMux(PORTB, 3U, kPORT_PinDisabledOrAnalog);

    /* PORTB4 (pin 15) is configured as LCD35 */
    PORT_SetPinMux(PORTB, 4U, kPORT_PinDisabledOrAnalog);

    /* PORTB5 (pin 16) is configured as LCD36 */
    PORT_SetPinMux(PORTB, 5U, kPORT_PinDisabledOrAnalog);

    /* PORTB6 (pin 17) is configured as LCD37 */
    PORT_SetPinMux(PORTB, 6U, kPORT_PinDisabledOrAnalog);

    /* PORTC4 (pin 23) is configured as LCD43 */
    PORT_SetPinMux(PORTC, 4U, kPORT_PinDisabledOrAnalog);

    /* PORTG2 (pin 77) is configured as LCD9 */
    PORT_SetPinMux(PORTG, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTG3 (pin 78) is configured as LCD10 */
    PORT_SetPinMux(PORTG, 3U, kPORT_PinDisabledOrAnalog);

    /* PORTG4 (pin 79) is configured as LCD11 */
    PORT_SetPinMux(PORTG, 4U, kPORT_PinDisabledOrAnalog);

    /* PORTG5 (pin 80) is configured as LCD12 */
    PORT_SetPinMux(PORTG, 5U, kPORT_PinDisabledOrAnalog);

    /* PORTG6 (pin 81) is configured as LCD13 */
    PORT_SetPinMux(PORTG, 6U, kPORT_PinDisabledOrAnalog);

    /* PORTG7 (pin 82) is configured as LCD14 */
    PORT_SetPinMux(PORTG, 7U, kPORT_PinDisabledOrAnalog);

    /* PORTH0 (pin 83) is configured as LCD15 */
    PORT_SetPinMux(PORTH, 0U, kPORT_PinDisabledOrAnalog);

    /* PORTH1 (pin 84) is configured as LCD16 */
    PORT_SetPinMux(PORTH, 1U, kPORT_PinDisabledOrAnalog);

    /* PORTH2 (pin 85) is configured as LCD17 */
    PORT_SetPinMux(PORTH, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTH3 (pin 86) is configured as LCD18 */
    PORT_SetPinMux(PORTH, 3U, kPORT_PinDisabledOrAnalog);

    /* PORTH4 (pin 87) is configured as LCD19 */
    PORT_SetPinMux(PORTH, 4U, kPORT_PinDisabledOrAnalog);

    /* PORTH5 (pin 88) is configured as LCD20 */
    PORT_SetPinMux(PORTH, 5U, kPORT_PinDisabledOrAnalog);

    /* PORTI0 (pin 91) is configured as SCI1_RxD/PXBAR_IN8 */
    PORT_SetPinMux(PORTI, 0U, kPORT_MuxAlt2);

    /* PORTI1 (pin 92) is configured as SCI1_TxD */
    PORT_SetPinMux(PORTI, 1U, kPORT_MuxAlt2);

    /* PORTI2 (pin 93) is configured as LCD21 */
    PORT_SetPinMux(PORTI, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTI3 (pin 94) is configured as LCD22 */
    PORT_SetPinMux(PORTI, 3U, kPORT_PinDisabledOrAnalog);

    SIM->MISC_CTL = ((SIM->MISC_CTL &
                      /* Mask bits to zero which are setting */
                      (~(SIM_MISC_CTL_UART1IRSEL_MASK)))

                     /* UART1 IRDA Select: Pad RX input (PTD[2] or PTI[0], as selected in Pinmux control)
                      * selected for RX input of UART1 and UART1 TX signal is not used for modulation. */
                     | SIM_MISC_CTL_UART1IRSEL(MISC_CTL_UART1IRSEL_0b0));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
